Revit 2015 API
CompoundStructureLayer Members
The CompoundStructureLayer type exposes the following members.
Constructors
Name | Description
CompoundStructureLayer()
 Creates a compound structure layer using default settings.
CompoundStructureLayer(CompoundStructureLayer)
 Creates a copy of compound structure layer.
CompoundStructureLayer(Double, MaterialFunctionAssignment, ElementId)
 Creates a default compound structure layer based on the given width, function and material element id.
Methods
Name | Description
Dispose
Releases all resources used by the CompoundStructureLayer
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
DeckEmbeddingType
 Embedding type for structural deck - only for a layer whose function is StructuralDeck.
DeckProfileId
 The ElementId of the structural deck profile - only for a layer whose function is StructuralDeck.
Function
 The function of the layer.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LayerCapFlag
 Identifies if the layer participates in the cap work.
LayerId
 The id of the layer - may be different from the index in the array of layers in a CompoundStructure.
MaterialId
 Id of the material assigned to this layer.
Width
 Width of the layer.
See Also
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace